wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
        // If we're on RP2040, we offload the button polling to the second core.
        #if /*!defined(ARDUINO_ARCH_RP2040) ||*/ !defined(DUAL_CORE) // 696969 per ESP32
        FW_Common::buttons.Poll(0);

            // Run through serial receive buffer once this run, if it has contents.
            if(Serial.available())
                OF_Serial::SerialProcessing();

                // For processing the trigger specifically.
                // (FW_Common::buttons.debounced is a binary variable intended to be read 1 bit at a time,
                // with the 0'th point == rightmost == decimal 1 == trigger, 3 = start, 4 = select)
        if(bitRead(FW_Common::buttons.debounced, FW_Const::BtnIdx_Trigger))   // Check if we pressed the Trigger this run.
                    TriggerFire();                                  // Handle button events and feedback ourselves.
        else TriggerNotFire();                              // Releasing button inputs and sending stop signals to feedback devices.

        #ifdef MAMEHOOKER
            if(OF_Serial::serialMode) OF_Serial::SerialHandling();                                   // Process the force feedback from the current queue.
        #endif // MAMEHOOKER
        #endif // DUAL_CORE

        if(FW_Common::irPosUpdateTick) {
            FW_Common::irPosUpdateTick = 0;
            FW_Common::GetPosition();
        }
        #ifdef USES_DISPLAY
            else {
                FW_Common::OLED.IdleOps();
        #ifdef MAMEHOOKER
                // For some reason, solenoid feedback is hella wonky when ammo updates are performed on the second core,
                // so just do it here using the signal sent by it.
                if(OF_Serial::serialDisplayChange) {
                    if(FW_Common::OLED.serialDisplayType == ExtDisplay::ScreenSerial_Ammo) {
                        FW_Common::OLED.PrintAmmo(OF_Serial::serialAmmoCount);
                    } else if(FW_Common::OLED.serialDisplayType == ExtDisplay::ScreenSerial_Life && FW_Common::OLED.lifeBar) {
                        FW_Common::OLED.PrintLife(FW_Common::dispLifePercentage);
                    } else if(FW_Common::OLED.serialDisplayType == ExtDisplay::ScreenSerial_Life) {
                        FW_Common::OLED.PrintLife(OF_Serial::serialLifeCount);
                    } else if(FW_Common::OLED.serialDisplayType == ExtDisplay::ScreenSerial_Both && FW_Common::OLED.lifeBar) {
                        FW_Common::OLED.PrintAmmo(OF_Serial::serialAmmoCount);
                        FW_Common::OLED.PrintLife(FW_Common::dispLifePercentage);
                    } else if(FW_Common::OLED.serialDisplayType == ExtDisplay::ScreenSerial_Both) {
                        FW_Common::OLED.PrintAmmo(OF_Serial::serialAmmoCount);
                        FW_Common::OLED.PrintLife(OF_Serial::serialLifeCount);
                    }

                    OF_Serial::serialDisplayChange = false;
                    }
                #endif // MAMEHOOKER
                }
            #endif // USES_DISPLAY

        // If using RP2040, we offload the button processing to the second core.
        #if /*!defined(ARDUINO_ARCH_RP2040) ||*/ !defined(DUAL_CORE)  // 696969 per ESP32

        #ifdef USES_ANALOG
            if(FW_Common::analogIsValid && (millis() - lastAnalogPoll > 1)) {
                AnalogStickPoll();
                lastAnalogPoll = millis();
            }
        #endif // USES_ANALOG

        #ifdef USES_TEMP
            if(OF_Prefs::pins[OF_Const::tempPin] > -1)
                OF_FFB::TemperatureUpdate();
        #endif // USES_TEMP

        if(FW_Common::buttons.pressedReleased == FW_Const::EscapeKeyBtnMask)
            SendEscapeKey();

        if(OF_Prefs::toggles[OF_Const::holdToPause]) {
            if((FW_Common::buttons.debounced == FW_Const::EnterPauseModeHoldBtnMask)
                && !FW_Common::lastSeen && !pauseHoldStarted) {
                pauseHoldStarted = true;
                pauseHoldStartstamp = millis();
                if(!OF_Serial::serialMode)
                    Serial.println("Started holding pause mode signal buttons!");

            } else if(pauseHoldStarted && (FW_Common::buttons.debounced != FW_Const::EnterPauseModeHoldBtnMask || FW_Common::lastSeen)) {
                pauseHoldStarted = false;
                if(!OF_Serial::serialMode)
                    Serial.println("Either stopped holding pause mode buttons, aimed onscreen, or pressed other buttons");

            } else if(pauseHoldStarted) {
                unsigned long t = millis();
                if(t - pauseHoldStartstamp > OF_Prefs::settings[OF_Const::holdToPauseLength]) {
                    // MAKE SURE EVERYTHING IS DISENGAGED:
                    OF_FFB::FFBShutdown();
		            Keyboard.releaseAll();
                    AbsMouse5.releaseAll();
                    Gamepad16.releaseAll();
                    FW_Common::offscreenBShot = false;
	    	        FW_Common::pauseModeSelection = PauseMode_Calibrate;
                    FW_Common::SetMode(FW_Const::GunMode_Pause);
                    FW_Common::buttons.ReportDisable();
                    return;
                }
            }
        } else {
            if(FW_Common::buttons.pressedReleased == FW_Const::EnterPauseModeBtnMask || FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Home) {
                // MAKE SURE EVERYTHING IS DISENGAGED:
                OF_FFB::FFBShutdown();
		        Keyboard.releaseAll();
                AbsMouse5.releaseAll();
                Gamepad16.releaseAll();
                FW_Common::offscreenBShot = false;
		        FW_Common::SetMode(FW_Const::GunMode_Pause);
                FW_Common::buttons.ReportDisable();
                return;
            }
        }
        #else  // if we're using dual cores, we just check if the gunmode has been changed by the other thread.
        if(FW_Common::gunMode != FW_Const::GunMode_Run) {
            Keyboard.releaseAll();
            AbsMouse5.releaseAll();
            Gamepad16.releaseAll();
            return;
        }
        #endif // ARDUINO_ARCH_RP2040 || DUAL_CORE

#ifdef DEBUG_SERIAL
        ++frameCount;
        OF_Serial::PrintDebugSerial();
#endif // DEBUG_SERIAL
    }
}

// from Samco_4IR_Test_BETA sketch
// for use with the Samco_4IR_Processing_Sketch_BETA Processing sketch
void ExecRunModeProcessing()
{
    FW_Common::buttons.ReportDisable();

